# Data Exploration

In [1]:
import acquire
%run prepare.ipynb

/usr/local/anaconda3/lib/python3.7/site-packages/sklearn/model_selection/_split.py:2179: FutureWarning: From version 0.21, test_size will always complement train_size unless both are specified.
  FutureWarning)
prepare.ipynb:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  "### Iris Data\n",
/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s
prepare.ipynb:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  "\n",
/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:543: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [2]:
# Split data into train (70%) & test (30%) samples. 
# You should end with 2 data frames: train_df and test_df

train_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
337,337,1,1,female,0.549488,0,0,0.262527,0,First,Cherbourg,1
179,179,0,3,male,0.481229,0,0,0.000000,3,Third,Southampton,1
132,132,0,3,female,0.631399,1,0,0.028302,3,Third,Southampton,0
702,702,0,3,female,0.235495,0,1,0.028213,0,Third,Cherbourg,0
372,372,0,3,male,0.249147,0,0,0.015713,3,Third,Southampton,1

In [3]:
test_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
342,342,0,2,male,0.372014,0,0,0.025374,3,Second,Southampton,1
742,742,1,1,female,0.276451,2,2,0.512122,0,First,Cherbourg,0
779,779,1,1,female,0.576792,0,1,0.412503,3,First,Southampton,0
509,509,1,3,male,0.344710,0,0,0.110272,3,Third,Southampton,1
60,60,0,3,male,0.290102,0,0,0.014110,0,Third,Cherbourg,1